{
  "modelTopology": {
    "class_name": "Model",
    "config": {
      "name": "model1",
      "layers": [
        {
          "name": "input1",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 48, 48, 1],
            "dtype": "float32",
            "sparse": false,
            "name": "input1"
          },
          "inbound_nodes": []
        },
        {
          "name": "conv_1",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [5, 5],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv_1",
            "trainable": true
          },
          "inbound_nodes": [[["input1", 0, 0, {}]]]
        },
        {
          "name": "conv_2",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv_2",
            "trainable": true
          },
          "inbound_nodes": [[["conv_1", 0, 0, {}]]]
        },
        {
          "name": "concatenate_Concatenate1",
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_Concatenate1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              ["conv_1", 0, 0, {}],
              ["conv_2", 0, 0, {}]
            ]
          ]
        },
        {
          "name": "maxpool1",
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last",
            "name": "maxpool1",
            "trainable": true
          },
          "inbound_nodes": [[["concatenate_Concatenate1", 0, 0, {}]]]
        },
        {
          "name": "conv_3",
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [1, 1],
            "strides": [1, 1],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv_3",
            "trainable": true
          },
          "inbound_nodes": [[["maxpool1", 0, 0, {}]]]
        },
        {
          "name": "conv_4",
          "class_name": "Conv2D",
          "config": {
            "filters": 128,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [5, 5],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv_4",
            "trainable": true
          },
          "inbound_nodes": [[["conv_3", 0, 0, {}]]]
        },
        {
          "name": "conv_5",
          "class_name": "Conv2D",
          "config": {
            "filters": 128,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "same",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv_5",
            "trainable": true
          },
          "inbound_nodes": [[["conv_4", 0, 0, {}]]]
        },
        {
          "name": "concatenate_Concatenate2",
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_Concatenate2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              ["conv_3", 0, 0, {}],
              ["conv_4", 0, 0, {}],
              ["conv_5", 0, 0, {}]
            ]
          ]
        },
        {
          "name": "maxpool2",
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last",
            "name": "maxpool2",
            "trainable": true
          },
          "inbound_nodes": [[["concatenate_Concatenate2", 0, 0, {}]]]
        },
        {
          "name": "conv_6",
          "class_name": "Conv2D",
          "config": {
            "filters": 128,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [1, 1],
            "strides": [1, 1],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv_6",
            "trainable": true
          },
          "inbound_nodes": [[["maxpool2", 0, 0, {}]]]
        },
        {
          "name": "conv_7",
          "class_name": "Conv2D",
          "config": {
            "filters": 128,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "activation": "relu",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv_7",
            "trainable": true
          },
          "inbound_nodes": [[["conv_6", 0, 0, {}]]]
        },
        {
          "name": "avg_pool1",
          "class_name": "AveragePooling2D",
          "config": {
            "pool_size": [2, 2],
            "padding": "valid",
            "strides": [2, 2],
            "data_format": "channels_last",
            "name": "avg_pool1",
            "trainable": true
          },
          "inbound_nodes": [[["conv_7", 0, 0, {}]]]
        },
        {
          "name": "flatten_Flatten1",
          "class_name": "Flatten",
          "config": {
            "name": "flatten_Flatten1",
            "trainable": true
          },
          "inbound_nodes": [[["avg_pool1", 0, 0, {}]]]
        },
        {
          "name": "dense_1",
          "class_name": "Dense",
          "config": {
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_1",
            "trainable": true
          },
          "inbound_nodes": [[["flatten_Flatten1", 0, 0, {}]]]
        },
        {
          "name": "dense_2",
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_2",
            "trainable": true
          },
          "inbound_nodes": [[["dense_1", 0, 0, {}]]]
        },
        {
          "name": "dense_3",
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_3",
            "trainable": true
          },
          "inbound_nodes": [[["dense_2", 0, 0, {}]]]
        },
        {
          "name": "output",
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "output",
            "trainable": true
          },
          "inbound_nodes": [[["dense_3", 0, 0, {}]]]
        }
      ],
      "input_layers": [["input1", 0, 0]],
      "output_layers": [["output", 0, 0]]
    },
    "keras_version": "tfjs-layers 3.7.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "conv_1/kernel",
          "shape": [5, 5, 1, 64],
          "dtype": "float32"
        },
        {
          "name": "conv_1/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv_2/kernel",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        {
          "name": "conv_2/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv_3/kernel",
          "shape": [1, 1, 128, 64],
          "dtype": "float32"
        },
        {
          "name": "conv_3/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv_4/kernel",
          "shape": [5, 5, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "conv_4/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv_5/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        {
          "name": "conv_5/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv_6/kernel",
          "shape": [1, 1, 320, 128],
          "dtype": "float32"
        },
        {
          "name": "conv_6/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv_7/kernel",
          "shape": [3, 3, 128, 128],
          "dtype": "float32"
        },
        {
          "name": "conv_7/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [3200, 512],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [512, 64],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [64, 32],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "output/kernel",
          "shape": [32, 1],
          "dtype": "float32"
        },
        {
          "name": "output/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v3.7.0",
  "convertedBy": null
}
